In [1]:
import numpy as np

In [2]:
import pandas as pd

In [20]:
d={'A':['a0','a1','a1','a3'],'B':[10,20,30,30],'C':[30,60,60,70]}

In [21]:
d

{'A': ['a0', 'a1', 'a1', 'a3'], 'B': [10, 20, 30, 30], 'C': [30, 60, 60, 70]}

In [22]:
df=pd.DataFrame(d)

In [23]:
df

    A   B   C
0  a0  10  30
1  a1  20  60
2  a1  30  60
3  a3  30  70

In [24]:
df['A'].unique()

array(['a0', 'a1', 'a3'], dtype=object)

In [25]:
df['B'].unique()

array([10, 20, 30], dtype=int64)

In [27]:
df['A'].nunique()

3

In [28]:
df['A'].value_counts()

a1    2
a0    1
a3    1
Name: A, dtype: int64

In [46]:
def convert_to_square(a):
    return a**2

In [47]:
convert_to_square(4)

16

In [50]:
df['B'].apply(convert_to_square)

0    100
1    400
2    900
3    900
Name: B, dtype: int64

In [51]:
df['C'].sum()

220

In [53]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [56]:
df.head()

    A   B   C
0  a0  10  30
1  a1  20  60
2  a1  30  60
3  a3  30  70

In [57]:
df.head(2)

    A   B   C
0  a0  10  30
1  a1  20  60

In [58]:
df.tail(2)

    A   B   C
2  a1  30  60
3  a3  30  70

## head,tail = 50 default values beyond that it cannot display

In [59]:
df.isnull()

       A      B      C
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [67]:
d={'A':['a0','a1',np.nan,'a3'],'B':[10,np.nan,30,30],'C':[np.nan,60,60,np.nan]}

In [68]:
d

{'A': ['a0', 'a1', nan, 'a3'], 'B': [10, nan, 30, 30], 'C': [nan, 60, 60, nan]}

In [69]:
df=pd.DataFrame(d)

In [70]:
df

     A     B     C
0   a0  10.0   NaN
1   a1   NaN  60.0
2  NaN  30.0  60.0
3   a3  30.0   NaN

In [71]:
df.isnull()

       A      B      C
0  False  False   True
1  False   True  False
2   True  False  False
3  False  False   True